In [1]:
import pandas as pd
import numpy as np
import sqlite3
import os

In [3]:
current_directory = os.getcwd()
print(current_directory)

C:\Users\matth\OneDrive\Desktop\Assignments\Lab_Assignment

In [5]:
con = sqlite3.connect(r'./data/python.db')

school_data = pd.read_sql_query("SELECT * FROM school", con)
school_data
student_data = pd.read_sql_query("SELECT * FROM student", con)
student_data

,id,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,4,Bonnie Ray,F,9th,Huang High School,97,84
...,...,...,...,...,...,...,...,...
39165,39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75

In [9]:
# join the two tables into a single dataframe
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
school_data_complete.head()

,id_x,Student ID,student_name,gender,grade,school_name,reading_score,math_score,id_y,School ID,type,size,budget
0,0,0,Paul Bradley,M,9th,Huang High School,66,79,0,0,District,2917,1910635
1,1,1,Victor Smith,M,12th,Huang High School,94,61,0,0,District,2917,1910635
2,2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,0,District,2917,1910635
3,3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,0,District,2917,1910635
4,4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,0,District,2917,1910635

In [17]:
# Total number of schools
total_schools = school_data["school_name"].nunique()

# Total number of students
total_students = student_data["Student ID"].count()

# Total budget (sum of all school budgets)
total_budget = school_data["budget"].sum()

# Average math score
average_math_score = student_data["math_score"].mean()

# Average reading score
average_reading_score = student_data["reading_score"].mean()

# Overall average score
overall_average_score = (average_math_score + average_reading_score) / 2

# Percentage of students passing math (70 or greater)
passing_math_percentage = (student_data["math_score"] >= 70).mean() * 100

In [21]:
# Create a District Summary
district_summary = pd.DataFrame({
    "Total Schools": [total_schools],
    "Total Students": [total_students],
    "Total Budget": [total_budget],
    "Average Math Score": [average_math_score],
    "Average Reading Score": [average_reading_score],
    "Overall Average Score": [overall_average_score],
    "% Passing Math": [passing_math_percentage]
})

# Display the district summary
district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,Overall Average Score,% Passing Math
0,15,39170,24649428,78.985371,81.87784,80.431606,74.980853

In [25]:
# Total number of schools
total_schools = school_data["school_name"].nunique()
print(total_schools)

15

In [31]:
# Total number of students
total_students = student_data["Student ID"].nunique()
print(total_students)

39170

In [33]:
# Total budget
total_budget = school_data["budget"].sum()
print(total_budget)

24649428

In [35]:
# Average math score
average_math_score = student_data["math_score"].mean()
print(average_math_score)

78.98537145774827

In [37]:
# Average reading score
average_reading_score = student_data["reading_score"].mean()
print(average_reading_score)

81.87784018381414

In [39]:
# Overall average score
overall_average_score = (student_data["math_score"].mean() + student_data["reading_score"].mean()) / 2
print(overall_average_score)

80.43160582078121

In [41]:
# Percentage of passing math (70 or greater)
passing_math_percentage = (student_data[student_data["math_score"] >= 70]["Student ID"].count() / total_students) * 100
print(passing_math_percentage)

74.9808526933878